Дана строка. Необходимо подсчитать количество цифр в этой строке,
значение которых больше 5

string = "В этой строке : 1 2 3 4 5 0  8 9 7 "
def count_of_numbers(string1):
    count = 0
    for i in string1:
        if i.isdigit() and int(i) > 5:
            count += 1
    return count
print("Количество чисел меньше 5 в строке:", count_of_numbers(string))
